7767517
116 185
Input                    input                    0 1 input
Split                    splitncnn_input0         1 19 input input_splitncnn_0 input_splitncnn_1 input_splitncnn_2 input_splitncnn_3 input_splitncnn_4 input_splitncnn_5 input_splitncnn_6 input_splitncnn_7 input_splitncnn_8 input_splitncnn_9 input_splitncnn_10 input_splitncnn_11 input_splitncnn_12 input_splitncnn_13 input_splitncnn_14 input_splitncnn_15 input_splitncnn_16 input_splitncnn_17 input_splitncnn_18
Crop                     /Gather                  1 1 input_splitncnn_18 /Gather_output_0 -23309=1,0 -23310=1,1 -23311=1,0
Crop                     /Gather_1                1 1 input_splitncnn_17 /Gather_1_output_0 -23309=1,2 -23310=1,3 -23311=1,0
Split                    splitncnn_0              1 4 /Gather_1_output_0 /Gather_1_output_0_splitncnn_0 /Gather_1_output_0_splitncnn_1 /Gather_1_output_0_splitncnn_2 /Gather_1_output_0_splitncnn_3
BinaryOp                 /Mul                     2 1 /Gather_output_0 /Gather_1_output_0_splitncnn_3 /Mul_output_0 0=2
Reshape                  /Reshape                 1 1 /Mul_output_0 /Reshape_output_0 0=1
Crop                     /Gather_2                1 1 input_splitncnn_16 /Gather_2_output_0 -23309=1,1 -23310=1,2 -23311=1,0
Split                    splitncnn_1              1 2 /Gather_2_output_0 /Gather_2_output_0_splitncnn_0 /Gather_2_output_0_splitncnn_1
BinaryOp                 /Mul_1                   2 1 /Gather_2_output_0_splitncnn_1 /Gather_1_output_0_splitncnn_2 /Mul_1_output_0 0=2
Reshape                  /Reshape_1               1 1 /Mul_1_output_0 /Reshape_1_output_0 0=1
Crop                     /Gather_3                1 1 input_splitncnn_15 /Gather_3_output_0 -23309=1,3 -23310=1,4 -23311=1,0
Split                    splitncnn_2              1 4 /Gather_3_output_0 /Gather_3_output_0_splitncnn_0 /Gather_3_output_0_splitncnn_1 /Gather_3_output_0_splitncnn_2 /Gather_3_output_0_splitncnn_3
BinaryOp                 /Mul_2                   2 1 /Gather_2_output_0_splitncnn_0 /Gather_3_output_0_splitncnn_3 /Mul_2_output_0 0=2
Reshape                  /Reshape_2               1 1 /Mul_2_output_0 /Reshape_2_output_0 0=1
BinaryOp                 /Mul_3                   2 1 /Gather_1_output_0_splitncnn_1 /Gather_3_output_0_splitncnn_2 /Mul_3_output_0 0=2
Reshape                  /Reshape_3               1 1 /Mul_3_output_0 /Reshape_3_output_0 0=1
Crop                     /Gather_4                1 1 input_splitncnn_14 /Gather_4_output_0 -23309=1,4 -23310=1,5 -23311=1,0
Split                    splitncnn_3              1 4 /Gather_4_output_0 /Gather_4_output_0_splitncnn_0 /Gather_4_output_0_splitncnn_1 /Gather_4_output_0_splitncnn_2 /Gather_4_output_0_splitncnn_3
BinaryOp                 /Mul_4                   2 1 /Gather_1_output_0_splitncnn_0 /Gather_4_output_0_splitncnn_3 /Mul_4_output_0 0=2
Reshape                  /Reshape_4               1 1 /Mul_4_output_0 /Reshape_4_output_0 0=1
BinaryOp                 /Mul_5                   2 1 /Gather_3_output_0_splitncnn_1 /Gather_4_output_0_splitncnn_2 /Mul_5_output_0 0=2
Reshape                  /Reshape_5               1 1 /Mul_5_output_0 /Reshape_5_output_0 0=1
Crop                     /Gather_5                1 1 input_splitncnn_13 /Gather_5_output_0 -23309=1,5 -23310=1,6 -23311=1,0
Split                    splitncnn_4              1 4 /Gather_5_output_0 /Gather_5_output_0_splitncnn_0 /Gather_5_output_0_splitncnn_1 /Gather_5_output_0_splitncnn_2 /Gather_5_output_0_splitncnn_3
BinaryOp                 /Mul_6                   2 1 /Gather_3_output_0_splitncnn_0 /Gather_5_output_0_splitncnn_3 /Mul_6_output_0 0=2
Reshape                  /Reshape_6               1 1 /Mul_6_output_0 /Reshape_6_output_0 0=1
BinaryOp                 /Mul_7                   2 1 /Gather_4_output_0_splitncnn_1 /Gather_5_output_0_splitncnn_2 /Mul_7_output_0 0=2
Reshape                  /Reshape_7               1 1 /Mul_7_output_0 /Reshape_7_output_0 0=1
Crop                     /Gather_6                1 1 input_splitncnn_12 /Gather_6_output_0 -23309=1,6 -23310=1,7 -23311=1,0
Split                    splitncnn_5              1 4 /Gather_6_output_0 /Gather_6_output_0_splitncnn_0 /Gather_6_output_0_splitncnn_1 /Gather_6_output_0_splitncnn_2 /Gather_6_output_0_splitncnn_3
BinaryOp                 /Mul_8                   2 1 /Gather_4_output_0_splitncnn_0 /Gather_6_output_0_splitncnn_3 /Mul_8_output_0 0=2
Reshape                  /Reshape_8               1 1 /Mul_8_output_0 /Reshape_8_output_0 0=1
BinaryOp                 /Mul_9                   2 1 /Gather_5_output_0_splitncnn_1 /Gather_6_output_0_splitncnn_2 /Mul_9_output_0 0=2
Reshape                  /Reshape_9               1 1 /Mul_9_output_0 /Reshape_9_output_0 0=1
Crop                     /Gather_7                1 1 input_splitncnn_11 /Gather_7_output_0 -23309=1,7 -23310=1,8 -23311=1,0
Split                    splitncnn_6              1 4 /Gather_7_output_0 /Gather_7_output_0_splitncnn_0 /Gather_7_output_0_splitncnn_1 /Gather_7_output_0_splitncnn_2 /Gather_7_output_0_splitncnn_3
BinaryOp                 /Mul_10                  2 1 /Gather_5_output_0_splitncnn_0 /Gather_7_output_0_splitncnn_3 /Mul_10_output_0 0=2
Reshape                  /Reshape_10              1 1 /Mul_10_output_0 /Reshape_10_output_0 0=1
BinaryOp                 /Mul_11                  2 1 /Gather_6_output_0_splitncnn_1 /Gather_7_output_0_splitncnn_2 /Mul_11_output_0 0=2
Reshape                  /Reshape_11              1 1 /Mul_11_output_0 /Reshape_11_output_0 0=1
Crop                     /Gather_8                1 1 input_splitncnn_10 /Gather_8_output_0 -23309=1,8 -23310=1,9 -23311=1,0
Split                    splitncnn_7              1 4 /Gather_8_output_0 /Gather_8_output_0_splitncnn_0 /Gather_8_output_0_splitncnn_1 /Gather_8_output_0_splitncnn_2 /Gather_8_output_0_splitncnn_3
BinaryOp                 /Mul_12                  2 1 /Gather_6_output_0_splitncnn_0 /Gather_8_output_0_splitncnn_3 /Mul_12_output_0 0=2
Reshape                  /Reshape_12              1 1 /Mul_12_output_0 /Reshape_12_output_0 0=1
BinaryOp                 /Mul_13                  2 1 /Gather_7_output_0_splitncnn_1 /Gather_8_output_0_splitncnn_2 /Mul_13_output_0 0=2
Reshape                  /Reshape_13              1 1 /Mul_13_output_0 /Reshape_13_output_0 0=1
Crop                     /Gather_9                1 1 input_splitncnn_9 /Gather_9_output_0 -23309=1,9 -23310=1,10 -23311=1,0
Split                    splitncnn_8              1 4 /Gather_9_output_0 /Gather_9_output_0_splitncnn_0 /Gather_9_output_0_splitncnn_1 /Gather_9_output_0_splitncnn_2 /Gather_9_output_0_splitncnn_3
BinaryOp                 /Mul_14                  2 1 /Gather_7_output_0_splitncnn_0 /Gather_9_output_0_splitncnn_3 /Mul_14_output_0 0=2
Reshape                  /Reshape_14              1 1 /Mul_14_output_0 /Reshape_14_output_0 0=1
BinaryOp                 /Mul_15                  2 1 /Gather_8_output_0_splitncnn_1 /Gather_9_output_0_splitncnn_2 /Mul_15_output_0 0=2
Reshape                  /Reshape_15              1 1 /Mul_15_output_0 /Reshape_15_output_0 0=1
Crop                     /Gather_10               1 1 input_splitncnn_8 /Gather_10_output_0 -23309=1,10 -23310=1,11 -23311=1,0
Split                    splitncnn_9              1 4 /Gather_10_output_0 /Gather_10_output_0_splitncnn_0 /Gather_10_output_0_splitncnn_1 /Gather_10_output_0_splitncnn_2 /Gather_10_output_0_splitncnn_3
BinaryOp                 /Mul_16                  2 1 /Gather_8_output_0_splitncnn_0 /Gather_10_output_0_splitncnn_3 /Mul_16_output_0 0=2
Reshape                  /Reshape_16              1 1 /Mul_16_output_0 /Reshape_16_output_0 0=1
BinaryOp                 /Mul_17                  2 1 /Gather_9_output_0_splitncnn_1 /Gather_10_output_0_splitncnn_2 /Mul_17_output_0 0=2
Reshape                  /Reshape_17              1 1 /Mul_17_output_0 /Reshape_17_output_0 0=1
Crop                     /Gather_11               1 1 input_splitncnn_7 /Gather_11_output_0 -23309=1,11 -23310=1,12 -23311=1,0
Split                    splitncnn_10             1 4 /Gather_11_output_0 /Gather_11_output_0_splitncnn_0 /Gather_11_output_0_splitncnn_1 /Gather_11_output_0_splitncnn_2 /Gather_11_output_0_splitncnn_3
BinaryOp                 /Mul_18                  2 1 /Gather_9_output_0_splitncnn_0 /Gather_11_output_0_splitncnn_3 /Mul_18_output_0 0=2
Reshape                  /Reshape_18              1 1 /Mul_18_output_0 /Reshape_18_output_0 0=1
BinaryOp                 /Mul_19                  2 1 /Gather_10_output_0_splitncnn_1 /Gather_11_output_0_splitncnn_2 /Mul_19_output_0 0=2
Reshape                  /Reshape_19              1 1 /Mul_19_output_0 /Reshape_19_output_0 0=1
Crop                     /Gather_12               1 1 input_splitncnn_6 /Gather_12_output_0 -23309=1,12 -23310=1,13 -23311=1,0
Split                    splitncnn_11             1 4 /Gather_12_output_0 /Gather_12_output_0_splitncnn_0 /Gather_12_output_0_splitncnn_1 /Gather_12_output_0_splitncnn_2 /Gather_12_output_0_splitncnn_3
BinaryOp                 /Mul_20                  2 1 /Gather_10_output_0_splitncnn_0 /Gather_12_output_0_splitncnn_3 /Mul_20_output_0 0=2
Reshape                  /Reshape_20              1 1 /Mul_20_output_0 /Reshape_20_output_0 0=1
BinaryOp                 /Mul_21                  2 1 /Gather_11_output_0_splitncnn_1 /Gather_12_output_0_splitncnn_2 /Mul_21_output_0 0=2
Reshape                  /Reshape_21              1 1 /Mul_21_output_0 /Reshape_21_output_0 0=1
Crop                     /Gather_13               1 1 input_splitncnn_5 /Gather_13_output_0 -23309=1,13 -23310=1,14 -23311=1,0
Split                    splitncnn_12             1 4 /Gather_13_output_0 /Gather_13_output_0_splitncnn_0 /Gather_13_output_0_splitncnn_1 /Gather_13_output_0_splitncnn_2 /Gather_13_output_0_splitncnn_3
BinaryOp                 /Mul_22                  2 1 /Gather_11_output_0_splitncnn_0 /Gather_13_output_0_splitncnn_3 /Mul_22_output_0 0=2
Reshape                  /Reshape_22              1 1 /Mul_22_output_0 /Reshape_22_output_0 0=1
BinaryOp                 /Mul_23                  2 1 /Gather_12_output_0_splitncnn_1 /Gather_13_output_0_splitncnn_2 /Mul_23_output_0 0=2
Reshape                  /Reshape_23              1 1 /Mul_23_output_0 /Reshape_23_output_0 0=1
Crop                     /Gather_14               1 1 input_splitncnn_4 /Gather_14_output_0 -23309=1,14 -23310=1,15 -23311=1,0
Split                    splitncnn_13             1 4 /Gather_14_output_0 /Gather_14_output_0_splitncnn_0 /Gather_14_output_0_splitncnn_1 /Gather_14_output_0_splitncnn_2 /Gather_14_output_0_splitncnn_3
BinaryOp                 /Mul_24                  2 1 /Gather_12_output_0_splitncnn_0 /Gather_14_output_0_splitncnn_3 /Mul_24_output_0 0=2
Reshape                  /Reshape_24              1 1 /Mul_24_output_0 /Reshape_24_output_0 0=1
BinaryOp                 /Mul_25                  2 1 /Gather_13_output_0_splitncnn_1 /Gather_14_output_0_splitncnn_2 /Mul_25_output_0 0=2
Reshape                  /Reshape_25              1 1 /Mul_25_output_0 /Reshape_25_output_0 0=1
Crop                     /Gather_15               1 1 input_splitncnn_3 /Gather_15_output_0 -23309=1,15 -23310=1,16 -23311=1,0
Split                    splitncnn_14             1 4 /Gather_15_output_0 /Gather_15_output_0_splitncnn_0 /Gather_15_output_0_splitncnn_1 /Gather_15_output_0_splitncnn_2 /Gather_15_output_0_splitncnn_3
BinaryOp                 /Mul_26                  2 1 /Gather_13_output_0_splitncnn_0 /Gather_15_output_0_splitncnn_3 /Mul_26_output_0 0=2
Reshape                  /Reshape_26              1 1 /Mul_26_output_0 /Reshape_26_output_0 0=1
BinaryOp                 /Mul_27                  2 1 /Gather_14_output_0_splitncnn_1 /Gather_15_output_0_splitncnn_2 /Mul_27_output_0 0=2
Reshape                  /Reshape_27              1 1 /Mul_27_output_0 /Reshape_27_output_0 0=1
Crop                     /Gather_16               1 1 input_splitncnn_2 /Gather_16_output_0 -23309=1,16 -23310=1,17 -23311=1,0
Split                    splitncnn_15             1 4 /Gather_16_output_0 /Gather_16_output_0_splitncnn_0 /Gather_16_output_0_splitncnn_1 /Gather_16_output_0_splitncnn_2 /Gather_16_output_0_splitncnn_3
BinaryOp                 /Mul_28                  2 1 /Gather_14_output_0_splitncnn_0 /Gather_16_output_0_splitncnn_3 /Mul_28_output_0 0=2
Reshape                  /Reshape_28              1 1 /Mul_28_output_0 /Reshape_28_output_0 0=1
BinaryOp                 /Mul_29                  2 1 /Gather_15_output_0_splitncnn_1 /Gather_16_output_0_splitncnn_2 /Mul_29_output_0 0=2
Reshape                  /Reshape_29              1 1 /Mul_29_output_0 /Reshape_29_output_0 0=1
Crop                     /Gather_17               1 1 input_splitncnn_1 /Gather_17_output_0 -23309=1,17 -23310=1,18 -23311=1,0
Split                    splitncnn_16             1 3 /Gather_17_output_0 /Gather_17_output_0_splitncnn_0 /Gather_17_output_0_splitncnn_1 /Gather_17_output_0_splitncnn_2
BinaryOp                 /Mul_30                  2 1 /Gather_15_output_0_splitncnn_0 /Gather_17_output_0_splitncnn_2 /Mul_30_output_0 0=2
Reshape                  /Reshape_30              1 1 /Mul_30_output_0 /Reshape_30_output_0 0=1
BinaryOp                 /Mul_31                  2 1 /Gather_16_output_0_splitncnn_1 /Gather_17_output_0_splitncnn_1 /Mul_31_output_0 0=2
Reshape                  /Reshape_31              1 1 /Mul_31_output_0 /Reshape_31_output_0 0=1
Crop                     /Gather_18               1 1 input_splitncnn_0 /Gather_18_output_0 -23309=1,18 -23310=1,19 -23311=1,0
Split                    splitncnn_17             1 2 /Gather_18_output_0 /Gather_18_output_0_splitncnn_0 /Gather_18_output_0_splitncnn_1
BinaryOp                 /Mul_32                  2 1 /Gather_16_output_0_splitncnn_0 /Gather_18_output_0_splitncnn_1 /Mul_32_output_0 0=2
Reshape                  /Reshape_32              1 1 /Mul_32_output_0 /Reshape_32_output_0 0=1
BinaryOp                 /Mul_33                  2 1 /Gather_17_output_0_splitncnn_0 /Gather_18_output_0_splitncnn_0 /Mul_33_output_0 0=2
Reshape                  /Reshape_33              1 1 /Mul_33_output_0 /Reshape_33_output_0 0=1
Concat                   /Concat                  34 1 /Reshape_output_0 /Reshape_1_output_0 /Reshape_2_output_0 /Reshape_3_output_0 /Reshape_4_output_0 /Reshape_5_output_0 /Reshape_6_output_0 /Reshape_7_output_0 /Reshape_8_output_0 /Reshape_9_output_0 /Reshape_10_output_0 /Reshape_11_output_0 /Reshape_12_output_0 /Reshape_13_output_0 /Reshape_14_output_0 /Reshape_15_output_0 /Reshape_16_output_0 /Reshape_17_output_0 /Reshape_18_output_0 /Reshape_19_output_0 /Reshape_20_output_0 /Reshape_21_output_0 /Reshape_22_output_0 /Reshape_23_output_0 /Reshape_24_output_0 /Reshape_25_output_0 /Reshape_26_output_0 /Reshape_27_output_0 /Reshape_28_output_0 /Reshape_29_output_0 /Reshape_30_output_0 /Reshape_31_output_0 /Reshape_32_output_0 /Reshape_33_output_0 /Concat_output_0
InnerProduct             /l1/Gemm                 1 1 /Concat_output_0 /relu_1/Relu_output_0 0=17 1=1 2=578 9=1
ExpandDims               /rnn/Unsqueeze           1 1 /relu_1/Relu_output_0 /rnn/Unsqueeze_output_0 -23300=1,0
RNN                      /rnn/RNN                 1 2 /rnn/Unsqueeze_output_0 /rnn/Squeeze_output_0 /rnn/RNN_output_1 0=17 1=289
RNN                      /rnn/RNN_1               1 2 /rnn/Squeeze_output_0 /rnn/RNN_1_output_0 /rnn/RNN_1_output_1 0=17 1=289
Squeeze                  /rnn/Squeeze_2           1 1 /rnn/RNN_1_output_0 /rnn/Squeeze_2_output_0 -23300=2,0,1
ReLU                     /relu_2/Relu             1 1 /rnn/Squeeze_2_output_0 /relu_2/Relu_output_0
InnerProduct             /l2/Gemm                 1 1 /relu_2/Relu_output_0 /l2/Gemm_output_0 0=3 1=1 2=51
Softmax                  /Softmax                 1 1 /l2/Gemm_output_0 output
